florianlepont/skypane/firmware/sdkconfig.defaults
# SPDX-FileCopyrightText: 2026 YODE PTE LTD
# SPDX-FileCopyrightText: 2026 Florian Lepont
# SPDX-License-Identifier: Apache-2.0
# Modified from FlightPortrait (github.com/flightportrait/frame) for
# SkyPane; the changes are listed in firmware/VENDOR.md.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 960 KB framebuffer lives in PSRAM (XIAO ESP32-S3 Plus: octal/OPI PSRAM).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# No OTA code exists yet, so nothing ever marks an image valid; rollback
# stays off until OTA is implemented.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=n

# The task watchdog is a hang detector: it panics when a subscribed task
# stops feeding it for 60 s (the Kconfig maximum), and the next boot sees
# a task-WDT reset and backs off. The whole-wake budget is
# CONFIG_SKYPANE_WAKE_BUDGET_S, a separate timer.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_ESP_TASK_WDT_PANIC=y

# The full-memory test costs ~0.45 s on every wake.
CONFIG_SPIRAM_MEMTEST=n

# DHCP was ~3.0 s of a ~4.4 s no-change wake; re-requesting the last lease
# and skipping the ARP probe is the cheapest cut.
CONFIG_LWIP_DHCP_RESTORE_LAST_IP=y
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=n

# Trust only the ISRG roots behind the VPS's Let's Encrypt certificate; if
# Let's Encrypt ever moves to a root not in this directory, devices stop
# connecting until reflashed - update main/certs before that happens.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_NONE=y
CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE_PATH="main/certs"

# Needed to keep one TLS session per wake and resume it across deep sleep.
CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_CUSTOM_TRANSPORT=y

# The synchronous state machine runs polling and JSON parsing on
# app_main, nesting buffers inside the ESP-IDF TLS/HTTP client.
# ESP-IDF's 3584-byte default overflows during that path; keep explicit
# headroom (upstream: FlightPortrait README "Building").
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# FlightPortrait project settings. Kept as-is from upstream for this
# plan even though main/Kconfig.projbuild (which defines the CONFIG_FP_*
# namespace, including the panel pin map) is not introduced until plan
# 01-05 - see VENDOR.md. Do not hand-edit the pin values here; the EE02
# profile that overrides them is a separate, later overlay file.
CONFIG_FP_HW_REV="proto-e1004"
CONFIG_FP_PIN_EPD_SCK=7
CONFIG_FP_PIN_EPD_MOSI=9
CONFIG_FP_PIN_EPD_CS_M=10
CONFIG_FP_PIN_EPD_CS_S=2
CONFIG_FP_PIN_EPD_DC=11
CONFIG_FP_PIN_EPD_RST=38
CONFIG_FP_PIN_EPD_BUSY=13
CONFIG_FP_PIN_EPD_EN=12
CONFIG_FP_PIN_KEY0=3
CONFIG_FP_PIN_KEY1=4
CONFIG_FP_PIN_KEY2=5
CONFIG_FP_REPROVISION_HOLD_MS=2000
CONFIG_FP_FACTORY_RESET_HOLD_MS=10000

# Phase 1 implements no BLE provisioning - hardcoded credentials in a
# gitignored secrets.h replace it for a device that talks only to a
# local stub. Carrying the BLE/NimBLE stack would inflate the image for
# no Phase 1 behaviour.
CONFIG_BT_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=n
